ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm0gx218_gx207/RTC_B_1.0.xml
    <register id="RTC_B_SEC" width="32" offset="0x1118" description="RTC Seconds Register - Calendar Mode With Binary / BCD Format">
        <bitfield id="SECBIN" description="Seconds Binary (0 to 59). If RTCBCD=1 write to these bits will be ignored and read give the value 0." begin="5" end="0" width="6" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0x3B" description="Highest possible value"/>
        </bitfield>
        <bitfield id="SECLOWBCD" description="Seconds BCD  low digit (0 to 9). If RTCBCD=0 write to these bits will be ignored and read give the value 0." begin="11" end="8" width="4" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0x9" description="Highest possible value"/>
        </bitfield>
        <bitfield id="SECHIGHBCD" description="Seconds BCD  high digit (0 to 5). If RTCBCD=0 write to these bits will be ignored and read give the value 0." begin="14" end="12" width="3" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0x5" description="Highest possible value"/>
        </bitfield>
    </register>
    <register id="RTC_B_MIN" width="32" offset="0x111C" description="RTC Minutes Register - Calendar Mode With Binary / BCD Format">
        <bitfield id="MINBIN" description="Minutes Binary (0 to 59). If RTCBCD=1 write to these bits will be ignored and read give the value 0." begin="5" end="0" width="6" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0x3B" description="Highest possible value"/>
        </bitfield>
        <bitfield id="MINLOWBCD" description="Minutes BCD  low digit (0 to 9). If RTCBCD=0 write to these bits will be ignored and read give the value 0." begin="11" end="8" width="4" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0x9" description="Highest possible value"/>
        </bitfield>
        <bitfield id="MINHIGHBCD" description="Minutes BCD  high digit (0 to 5). If RTCBCD=0 write to these bits will be ignored and read give the value 0." begin="14" end="12" width="3" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0x5" description="Highest possible value"/>
        </bitfield>
    </register>
    <register id="RTC_B_HOUR" width="32" offset="0x1120" description="RTC Hours Register - Calendar Mode With Binary / BCD Format">
        <bitfield id="HOURBIN" description="Hours Binary (0 to 23). If RTCBCD=1 write to these bits will be ignored and read give the value 0." begin="4" end="0" width="5" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0x17" description="Highest possible value"/>
        </bitfield>
        <bitfield id="HOURLOWBCD" description="Hours BCD  low digit (0 to 9). If RTCBCD=0 write to these bits will be ignored and read give the value 0." begin="11" end="8" width="4" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0x9" description="Highest possible value"/>
        </bitfield>
        <bitfield id="HOURHIGHBCD" description="Hours BCD  high digit (0 to 2). If RTCBCD=0 write to these bits will be ignored and read give the value 0." begin="13" end="12" width="2" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0x2" description="Highest possible value"/>
        </bitfield>
    </register>
    <register id="RTC_B_DAY" width="32" offset="0x1124" description="RTC Day Of Week / Month Register - Calendar Mode With Binary / BCD Format">
        <bitfield id="DOW" description="Day of week (0 to 6). These bits are valid if RTCBCD=1 or RTCBCD=0." begin="2" end="0" width="3" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0x6" description="Highest possible value"/>
        </bitfield>
        <bitfield id="DOMBIN" description="Day of month Binary (1 to 28, 29, 30, 31). If RTCBCD=1 write to these bits will be ignored and read give the value 0." begin="12" end="8" width="5" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0x1F" description="Highest possible value"/>
        </bitfield>
        <bitfield id="DOMLOWBCD" description="Day of month BCD  low digit (0 to 9). If RTCBCD=0 write to these bits will be ignored and read give the value 0." begin="19" end="16" width="4" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0x9" description="Highest possible value"/>
        </bitfield>
        <bitfield id="DOMHIGHBCD" description="Day of month BCD  high digit (0 to 3). If RTCBCD=0 write to these bits will be ignored and read give the value 0." begin="21" end="20" width="2" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0x3" description="Highest possible value"/>
        </bitfield>
    </register>
    <register id="RTC_B_MON" width="32" offset="0x1128" description="RTC Month Register - Calendar Mode With Binary / BCD Format">
        <bitfield id="MONBIN" description="Month Binary (1 to 12). If RTCBCD=1 write to these bits will be ignored and read give the value 0." begin="3" end="0" width="4" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xC" description="Highest possible value"/>
        </bitfield>
        <bitfield id="MONLOWBCD" description="Month BCD  low digit (0 to 9). If RTCBCD=0 write to these bits will be ignored and read give the value 0." begin="11" end="8" width="4" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0x9" description="Highest possible value"/>
        </bitfield>
        <bitfield id="MONHIGHBCD" description="Month BCD  high digit (0 or 1). If RTCBCD=0 write to these bits will be ignored and read give the value 0." begin="12" end="12" width="1" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0x1" description="Highest possible value"/>
        </bitfield>
    </register>
    <register id="RTC_B_YEAR" width="32" offset="0x112C" description="RTC Year Register - Calendar Mode With Binary / BCD Format">
        <bitfield id="YEARLOWBIN" description="Year Binary  low byte. Valid values for Year are 0 to 4095. If RTCBCD=1 write to these bits will be ignored and read give the value 0." begin="7" end="0" width="8" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xFF" description="Highest possible value"/>
        </bitfield>
        <bitfield id="YEARHIGHBIN" description="Year Binary  high byte. Valid values for Year are 0 to 4095. If RTCBCD=1 write to these bits will be ignored and read give the value 0." begin="11" end="8" width="4" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xF" description="Highest possible value"/>
        </bitfield>
        <bitfield id="YEARLOWESTBCD" description="Year BCD  lowest digit (0 to 9). If RTCBCD=0 write to these bits will be ignored and read give the value 0." begin="19" end="16" width="4" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0x9" description="Highest possible value"/>
        </bitfield>
        <bitfield id="DECADEBCD" description="Decade BCD (0 to 9). If RTCBCD=0 write to these bits will be ignored and read give the value 0." begin="23" end="20" width="4" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0x9" description="Highest possible value"/>
        </bitfield>
        <bitfield id="CENTLOWBCD" description="Century BCD  low digit (0 to 9). If RTCBCD=0 write to these bits will be ignored and read give the value 0." begin="27" end="24" width="4" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0x9" description="Highest possible value"/>
        </bitfield>
        <bitfield id="CENTHIGHBCD" description="Century BCD  high digit (0 to 4). If RTCBCD=0 write to these bits will be ignored and read give the value 0." begin="30" end="28" width="3" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0x4" description="Highest possible value"/>
        </bitfield>
    </register>
